n=int(input("Колко елементи ще има в списъка: "))
l=[]
sum=0
max=None
index_max=0
for i in range(n):
    x=int(input(f"[{i+1}]"))
    l.append(x)
    if x>10:
        num=(x//10)%10
        if num % 3==0:
            sum+=x
    if x<0:
        if max is None or x>max:
            max=x
            index_max=i
    if max is None:
        print("")
    else:
        print(max,index_max)
print(l)
print(sum)
#1
number1 = input("Въведи низ: ")
number = ""
l = []
for x in number1:
    if x == '-':
        if number:
            l.append(int(number))
        number = "-"
    else:
        number += x
if number:
    l.append(int(number))
print(l)
#2зад. Списък с Кратни
#Напишете програма, която получава две числа (множител и брой). Трябва да създаде списък с дължина дадения брой, 
# който съдържа само цели числа, които са кратни на дадения множител. Числата трябва да са само положителни и трябва да са 
# подредени във възходящ ред, започвайки от стойността на множителя.
n=int(input("Въведете множител(цяло число): "))
m=int(input("Въведете брой(цяло число): "))
l=[]
for i in range(1, m + 1):
    l.append(n * i)
print(l)
#Ззад. Оцеляване на Най-големите
#Напишете програма, която получава списък от цели числа (разделени с един интервал) и число п. 
#Числото и представлява броя на числата, които трябва да се премахнат от списъка. 
#Трябва да премахнете най-малките числа и след това да отпечатате всички числа, които остават в списъка, разделени със запетая и интервал ", ".
# Вход
# Вход от потребителя
n = input("Въведи списък от числа (с интервал): ")
p = int(input("Колко най-малки числа да се премахнат: "))
l = []
for x in n.split():
    l.append(int(x))
for i in range(p):
    min_number = min(l)
    l.remove(min_number)  
for i in range(len(l)):
    print(l[i], end="")
    if i != len(l) - 1:
        print(", ", end="")
#4зад. Задача речници
#Напишете програма, която получава списък от символи, разделени със", ". Трябва да създаде речник, в който всеки символ е ключ, 
#а неговата ASCII стойност е стойност на елемента с този ключ. Опитайте се да решите задачата чрез сomprehension.
# Вход
symbols = input("Въведи символи, разделени със ', ': ")
ascii_dict = {x: ord(x) for x in symbols.split(", ")}
print(ascii_dict)
#Пишем програма, в която потребителят въежда едно цяло число, на база на което създаваме списък, чийто последен елемент е цялото въведено число, възоснова на списъкът създаваме речник
#елементите на списъка = служат за ключ на речника, а стойностите на речника са елементите на списъкът в обратен ред
n=int(input("Въведете цяло число"))
l=[]
for i in range(1,n+1):
    l.append(i)
d={}
d={l[i]:l[-(i+1)] for i in range(len(l))}
print(l)
print(d)
for i in range(len(l)):
    d[l[i]] = l[-(i+1)]
    